cf/InformationRegisters/ДоверенныеЛицаПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДоверенныеЛицаПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидитСписокМоихЗадач</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоверенноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/ДоверенныеЛицаПользователя/Forms/МоиДоверенныеЛица/Ext/Form/Module.bsl
&НаКлиенте
Процедура Запомнить(Команда)
	ЗапомнитьЛиц();	
КонецПроцедуры

&НаСервере
Процедура ЗапомнитьЛиц()
	
	Набор = РегистрыСведений.ДоверенныеЛицаПользователя.СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Установить(Пользователь);
	
	Набор.Прочитать();
	Набор.Очистить();
	
	Набор.Загрузить(ДовернныеЛица.Выгрузить());
	
	Набор.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЛиц()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Пользователь,
	|	ДоверенноеЛицо,
	|	ВидитСписокМоихЗадач
	|ИЗ
	|	РегистрСведений.ДоверенныеЛицаПользователя
	|ГДЕ Пользователь = &Пользователь
	|");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Рез = Запрос.Выполнить();
	
	Если НЕ Рез.Пустой() Тогда
		ДовернныеЛица.Загрузить(Рез.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	ЗаполнитьЛиц();
	
	Элементы.Пользователь.КнопкаВыбора = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ПолныеПраваВОбласти");
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	ДовернныеЛица.Очистить();
	ЗаполнитьЛиц();
КонецПроцедуры

&НаКлиенте
Процедура ЗапомнитьИЗакрыть(Команда)
	ЗапомнитьЛиц();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДоверенноеЛицоПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ДовернныеЛицаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока Тогда
		Элементы.ДовернныеЛица.ТекущиеДанные.Пользователь = Пользователь;
	КонецЕсли;
КонецПроцедуры
